# **1. Introducing DataFrames**

üß∞ ŸÖŸÉŸàŸÜÿßÿ™ ÿßŸÑŸÄ DataFrame
1. .values
ÿ®Ÿäÿ±ÿ¨ÿπ ÿßŸÑŸÖÿµŸÅŸàŸÅÿ© (array) ÿßŸÑŸÑŸä ÿ®ÿ™ŸÖÿ´ŸÑ ÿßŸÑÿ®ŸäÿßŸÜÿßÿ™ÿå Ÿàÿ®ÿ™ŸÉŸàŸÜ ŸÖŸÜ ŸÜŸàÿπ NumPy 2D array.

2. .columns
ÿ®ÿ™ÿ±ÿ¨ÿπ ÿ£ÿ≥ŸÖÿßÿ° ÿßŸÑÿ£ÿπŸÖÿØÿ© ŸÉŸÄ Index object (ŸÖÿ¥ ŸÖÿ¨ÿ±ÿØ list ÿπÿßÿØŸäÿ©).

3. .index
ÿ®ÿ™ÿ±ÿ¨ÿπ ÿ£ÿ≥ŸÖÿßÿ° ÿßŸÑÿµŸÅŸàŸÅ ÿ£Ÿà ÿ£ÿ±ŸÇÿßŸÖŸáŸÖ (ŸÉŸÖÿßŸÜ ŸÉŸÄ Index object).

Column :

ÿµŸÅ = ŸÉŸÑÿ® (Observation)

ÿπŸÖŸàÿØ = ÿÆÿßÿµŸäÿ© (Variable)

ŸÉŸÑ ÿ£ÿπŸÖÿØÿ© DataFrame ÿ®Ÿäÿ™ŸÖ ÿ™ŸÖÿ´ŸäŸÑŸáÿß ŸÉŸÖÿµŸÅŸàŸÅÿßÿ™ ŸÖŸÜ NumPy (1D ÿ£Ÿà 2D)

ŸÉŸÑ ÿπŸÖŸàÿØ ŸÑÿßÿ≤ŸÖ ŸäŸÉŸàŸÜ ŸÖŸÜ ŸÜŸÅÿ≥ ÿßŸÑŸÜŸàÿπ (ÿ±ŸÇŸÖŸä ÿ£Ÿà ŸÜÿµŸä ÿ£Ÿà ŸÖŸÜÿ∑ŸÇŸä).

ŸÑŸÉŸÜ ÿßŸÑÿ£ÿπŸÖÿØÿ© ŸÜŸÅÿ≥Ÿáÿß ŸÖŸÖŸÉŸÜ ÿ™ŸÉŸàŸÜ ÿ®ÿ£ŸÜŸàÿßÿπ ŸÖÿÆÿ™ŸÑŸÅÿ©.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt



df = pd.read_csv("../Other/heart.csv")
display(df.head())              # Ÿäÿπÿ±ÿ∂ ÿ£ŸàŸÑ 5 ÿµŸÅŸàŸÅ

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       303 non-null    int64
 1   sex       303 non-null    int64
 2   cp        303 non-null    int64
 3   trestbps  303 non-null    int64
 4   chol      303 non-null    int64
 5   fbs       303 non-null    int64
 6   restecg   303 non-null    int64
 7   thalach   303 non-null    int64
 8   exang     303 non-null    int64
 9   oldpeak   303 non-null    float64
 10  slope     303 non-null    int64
 11  ca        303 non-null    int64
 12  thal      303 non-null    int64
 13  target    303 non-null    int64
dtypes: float64(1), int64(13)
memory usage: 33.3 KB

In [31]:
print(df.shape)   # (rows, columns)
print(len(df))
print("_"*50)
df.describe()

(303, 16)
303
__________________________________________________

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,man_2
count,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000
mean,54.366337,0.683168,0.966997,131.623762,246.264026,0.148515,0.528053,149.646865,0.326733,1.039604,1.399340,0.729373,2.313531,0.544554,1.227723
std,9.082101,0.466011,1.032052,17.538143,51.830751,0.356198,0.525860,22.905161,0.469794,1.161075,0.616226,1.022606,0.612277,0.498835,0.579127
min,29.000000,0.000000,0.000000,94.000000,126.000000,0.000000,0.000000,71.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,47.500000,0.000000,0.000000,120.000000,211.000000,0.000000,0.000000,133.500000,0.000000,0.000000,1.000000,0.000000,2.000000,0.000000,1.000000
50%,55.000000,1.000000,1.000000,130.000000,240.000000,0.000000,1.000000,153.000000,0.000000,0.800000,1.000000,0.000000,2.000000,1.000000,1.000000
75%,61.000000,1.000000,2.000000,140.000000,274.500000,0.000000,1.000000,166.000000,1.000000,1.600000,2.000000,1.000000,3.000000,1.000000,2.000000
max,77.000000,1.000000,3.000000,200.000000,564.000000,1.000000,2.000000,202.000000,1.000000,6.200000,2.000000,4.000000,3.000000,1.000000,2.000000

In [18]:
print(df.values)   # ÿ™ÿ±ÿ¨ÿπ ÿßŸÑÿ®ŸäÿßŸÜÿßÿ™ ŸÉŸÖÿµŸÅŸàŸÅÿ© NumPy (2D).

[[63.  1.  3. ...  0.  1.  1.]
 [37.  1.  2. ...  0.  2.  1.]
 [41.  0.  1. ...  0.  2.  1.]
 ...
 [68.  1.  0. ...  2.  3.  0.]
 [57.  1.  0. ...  1.  3.  0.]
 [57.  0.  1. ...  1.  2.  0.]]

In [12]:
print(df.columns)           # ÿ£ÿ≥ŸÖÿßÿ° ÿßŸÑÿ£ÿπŸÖÿØÿ©
print("_"*50)
print(df.index)             # ÿ£ÿ≥ŸÖÿßÿ° ÿßŸÑÿµŸÅŸàŸÅ

# ‚ÄúThey are Index objects, not just lists.‚Äù
# ŸÖÿ¥ ŸÖÿ¨ÿ±ÿØ list ŸàŸÑŸÉŸÜ ÿπÿ®ÿßÿ±ÿ© ÿπŸÜ index

print("_"*50)
print("age" in df.columns)

Index(['age', 'sex', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'slope', 'ca', 'thal', 'target'],
      dtype='object')
__________________________________________________
RangeIndex(start=0, stop=303, step=1)
__________________________________________________
True

In [5]:
display(df["age"].head())      # ÿßŸÑÿ∑ÿ±ŸäŸÇÿ© ÿßŸÑŸÖŸàÿµŸâ ÿ®Ÿáÿß
print("_"*70)
display(df.age.head() )         # ÿ¥ÿ∫ÿßŸÑÿ©ÿå ŸÑŸÉŸÜ ŸÖÿ¥ ÿØÿßŸäŸÖŸãÿß ŸÖÿ∂ŸÖŸàŸÜÿ©

0    63
1    37
2    41
3    56
4    57
Name: age, dtype: int64

______________________________________________________________________

0    63
1    37
2    41
3    56
4    57
Name: age, dtype: int64

In [7]:
df[["age", "sex"]].head()

   age  sex
0   63    1
1   37    1
2   41    0
3   56    1
4   57    0

In [8]:
pd.Series([1 , 2 , 3 , 4 , 'a'])

0    1
1    2
2    3
3    4
4    a
dtype: object

In [ ]:
pd.DataFrame([[1, 2, 3],
              [4, 5, 6],
              [7, 8, 9]],
             columns=['col_1', 'col_2', 'col_3'],
             index=[3, 6, 9])

In [14]:
data = pd.DataFrame({
    'Name' : ['Sara' , 'Ahmed' , 'Ali' , 'Hassan'],
    'Age' : [19 , 18 , 20 , 21],
    'Gender': ['F' , 'M' ,'M' , 'M']
}, index=range(20 , 24))

data

      Name  Age Gender
20    Sara   19      F
21   Ahmed   18      M
22     Ali   20      M
23  Hassan   21      M

In [16]:
data['Course'] =['AI', 'ML', 'NLP', 'Web']
data

      Name  Age Gender Course
20    Sara   19      F     AI
21   Ahmed   18      M     ML
22     Ali   20      M    NLP
23  Hassan   21      M    Web

In [17]:
data_2 = pd.DataFrame({
    'Name' : ['Ibrahim' , 'Mohamed' , 'youssef'],
    'Age' : [20 , 23 , 24 ],
    'Gender': ['F' , 'M' ,'M' ],
    'Course':['AI' , 'CS' , 'Web']})

In [19]:
new_data = pd.concat([data, data_2], ignore_index=True)
new_data

      Name  Age Gender Course
0     Sara   19      F     AI
1    Ahmed   18      M     ML
2      Ali   20      M    NLP
3   Hassan   21      M    Web
4  Ibrahim   20      F     AI
5  Mohamed   23      M     CS
6  youssef   24      M    Web

In [27]:
# count values
new_data['Course'].value_counts()

Course
AI     2
Web    2
ML     1
NLP    1
CS     1
Name: count, dtype: int64

In [28]:
# unique
new_data['Course'].unique()

array(['AI', 'ML', 'NLP', 'Web', 'CS'], dtype=object)

In [29]:
# num of unique values
new_data['Course'].nunique()

5

In [21]:
dict_1 = {'name': ['taho', 'yahya'], 'age': [10, 20],'gender':['m','m']}
dict_2 = {'std_name': ['rana', 'yasmen'], 'std_age': [15, 14],'std_gender':['f','f']}
df1 = pd.DataFrame(dict_1)
df2 = pd.DataFrame(dict_2)
result = pd.concat([df1, df2],ignore_index=True)
result

    name   age gender std_name  std_age std_gender
0   taho  10.0      m      NaN      NaN        NaN
1  yahya  20.0      m      NaN      NaN        NaN
2    NaN   NaN    NaN     rana     15.0          f
3    NaN   NaN    NaN   yasmen     14.0          f

In [22]:
result.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        2 non-null      object
 1   age         2 non-null      float64
 2   gender      2 non-null      object
 3   std_name    2 non-null      object
 4   std_age     2 non-null      float64
 5   std_gender  2 non-null      object
dtypes: float64(2), object(4)
memory usage: 324.0+ bytes

# **2. Sorting and Subscting**

In [34]:
display(df.sort_values("age").head())

display(df.sort_values("age", ascending=False).head())    # ÿ™ŸÜÿßÿ≤ŸÑŸä

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,old_people,man_2
72,29,1,1,130,204,0,0,202,0,0.0,2,0,2,1,False,2
58,34,1,3,118,182,0,0,174,0,0.0,2,0,2,1,False,2
125,34,0,1,118,210,0,1,192,0,0.7,2,0,2,1,False,1
65,35,0,0,138,183,0,1,182,0,1.4,2,0,2,1,False,1
227,35,1,0,120,198,0,1,130,1,1.6,1,0,3,0,False,1

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,old_people,man_2
238,77,1,0,125,304,0,0,162,1,0.0,2,3,2,0,True,1
144,76,0,2,140,197,0,2,116,0,1.1,1,0,2,1,True,1
129,74,0,1,120,269,0,0,121,1,0.2,2,1,2,1,True,1
25,71,0,1,160,302,0,1,162,0,0.4,2,2,2,1,True,1
151,71,0,0,112,149,0,1,125,0,1.6,1,0,2,1,True,1

In [38]:
display(df.sort_values(["age", "sex"]).head())
#‚Äúsort first by age, then by sex.‚Äù

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,old_people,man_2
72,29,1,1,130,204,0,0,202,0,0.0,2,0,2,1,False,2
125,34,0,1,118,210,0,1,192,0,0.7,2,0,2,1,False,1
58,34,1,3,118,182,0,0,174,0,0.0,2,0,2,1,False,2
65,35,0,0,138,183,0,1,182,0,1.4,2,0,2,1,False,1
157,35,1,1,122,192,0,1,174,0,0.0,2,0,2,1,False,2

In [40]:
new_data = df.sort_values(["age", "sex"], ascending= [True, False], inplace=False, ignore_index=True)
new_data.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,old_people,man_2
0,29,1,1,130,204,0,0,202,0,0.0,2,0,2,1,False,2
1,34,1,3,118,182,0,0,174,0,0.0,2,0,2,1,False,2
2,34,0,1,118,210,0,1,192,0,0.7,2,0,2,1,False,1
3,35,1,1,122,192,0,1,174,0,0.0,2,0,2,1,False,2
4,35,1,0,120,198,0,1,130,1,1.6,1,0,3,0,False,1

##  **5. Subsetting Rows ‚Äì ÿ™ÿµŸÅŸäÿ© ÿµŸÅŸàŸÅ**

In [36]:
display(df[df["age"] > 75])

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,old_people,man_2
144,76,0,2,140,197,0,2,116,0,1.1,1,0,2,1,True,1
238,77,1,0,125,304,0,0,162,1,0.0,2,3,2,0,True,1

In [37]:
display(df[df["age"] == 35])

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,old_people,man_2
65,35,0,0,138,183,0,1,182,0,1.4,2,0,2,1,False,1
157,35,1,1,122,192,0,1,174,0,0.0,2,0,2,1,False,2
227,35,1,0,120,198,0,1,130,1,1.6,1,0,3,0,False,1
239,35,1,0,126,282,0,0,156,1,0.0,2,0,3,0,False,1

In [45]:
display(new_data[ (new_data["age"] == 35 ) & (new_data["sex"] == 1)])

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,old_people,man_2
3,35,1,1,122,192,0,1,174,0,0.0,2,0,2,1,False,2
4,35,1,0,120,198,0,1,130,1,1.6,1,0,3,0,False,1
5,35,1,0,126,282,0,0,156,1,0.0,2,0,3,0,False,1

In [44]:
display(new_data[new_data["age"].isin([35, 45])])

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,old_people,man_2
3,35,1,1,122,192,0,1,174,0,0.0,2,0,2,1,False,2
4,35,1,0,120,198,0,1,130,1,1.6,1,0,3,0,False,1
5,35,1,0,126,282,0,0,156,1,0.0,2,0,3,0,False,1
6,35,0,0,138,183,0,1,182,0,1.4,2,0,2,1,False,1
56,45,1,0,104,208,0,0,148,1,3.0,1,0,2,1,False,2
57,45,1,0,115,260,0,0,185,0,0.0,2,0,2,1,False,2
58,45,1,1,128,308,0,0,170,0,0.0,2,0,2,1,False,2
59,45,1,0,142,309,0,0,147,1,0.0,1,3,3,0,False,1
60,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0,False,1
61,45,0,1,130,234,0,0,175,0,0.6,1,0,2,1,False,1
62,45,0,1,112,160,0,1,138,0,0.0,1,0,2,1,False,1
63,45,0,0,138,236,0,0,152,1,0.2,1,0,2,1,False,1

**3.Creating new columns**

In [46]:
df["old_people"] = df["age"]  > 60
df["man_2"] = df["sex"]  + df["target"]
display(df.head())

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,old_people,man_2
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1,True,2
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1,False,2
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1,False,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1,False,2
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1,False,1

In [50]:
display(new_data[new_data["old_people"]].head())

display(df.sort_values("old_people", ignore_index=True).head())

display(new_data[["age", "old_people"]].head())

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,old_people,man_2
224,61,1,2,150,243,1,1,137,1,1.0,1,0,2,1,True,2
225,61,1,0,120,260,0,1,140,1,3.6,1,1,3,0,True,1
226,61,1,3,134,234,0,1,145,0,2.6,1,2,2,0,True,1
227,61,1,0,138,166,0,0,125,1,3.6,1,1,2,0,True,1
228,61,1,0,140,207,0,0,138,1,1.9,2,1,3,0,True,1

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,old_people,man_2
0,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0,False,0
1,42,1,2,130,180,0,1,150,0,0.0,2,0,2,1,False,2
2,46,1,0,120,249,0,0,144,0,0.8,2,0,3,0,False,1
3,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0,False,1
4,56,1,0,130,283,1,0,103,1,1.6,0,0,3,0,False,1

   age  old_people
0   29       False
1   34       False
2   34       False
3   35       False
4   35       False

# **3. Summary Statistics**

In [51]:
print("mean = ", df["age"].mean())
print("median = ", df["age"].median())
print("mode = ", df["age"].mode())
print("std = ", df["age"].std())
print("var = ", df["age"].var())
print("Q1 = ", df["age"].quantile(0.25))
print("Q2 = ", df["age"].quantile(0.50))
print("Q3 = ", df["age"].quantile(0.75))
print("min = ", df["age"].min())
print("max = ", df["age"].max())

print("_"*40)

df.describe()["age"]

mean =  54.366336633663366
median =  55.0
mode =  0    58
Name: age, dtype: int64
std =  9.082100989837857
var =  82.48455838961378
Q1 =  47.5
Q2 =  55.0
Q3 =  61.0
min =  29
max =  77
________________________________________

count    303.000000
mean      54.366337
std        9.082101
min       29.000000
25%       47.500000
50%       55.000000
75%       61.000000
max       77.000000
Name: age, dtype: float64

## **.agg()**

aggregate = "Ÿäÿ¨ŸÖÿπ/ŸäŸÑÿÆŸëÿµ" ÿßŸÑÿ®ŸäÿßŸÜÿßÿ™

ŸàŸáŸä ÿØÿßŸÑÿ© ŸÅŸä pandas ÿ®ÿ™ÿÆŸÑŸäŸÉ:

ÿ™ÿ∑ÿ®ŸëŸÇ ÿØŸàÿßŸÑ ÿ•ÿ≠ÿµÿßÿ¶Ÿäÿ© (ÿ≤Ÿä mean, sum, min...)

ÿ£Ÿà ÿ≠ÿ™Ÿâ ÿØŸàÿßŸÑ ŸÖÿÆÿµÿµÿ© (ÿ•ŸÜÿ™ ÿ®ÿ™ŸÉÿ™ÿ®Ÿáÿß ÿ®ŸÜŸÅÿ≥ŸÉ)

ÿπŸÑŸâ ÿπŸÖŸàÿØ Ÿàÿßÿ≠ÿØ ÿ£Ÿà ÿπÿØÿ© ÿ£ÿπŸÖÿØÿ©

‚öôÔ∏è 4. ÿßÿ≥ÿ™ÿÆÿØÿßŸÖ .agg() ŸÑÿ•ÿ≠ÿµÿßÿ¶Ÿäÿßÿ™ ŸÖÿÆÿµÿµÿ©

ÿ®ÿ™ÿÆŸÑŸëŸäŸÉ ÿ™ÿ∑ÿ®ŸÇ ÿπÿØÿ© ÿØŸàÿßŸÑ ŸÖÿ±ÿ© Ÿàÿßÿ≠ÿØÿ©

ÿ®ÿ™ŸÇÿ®ŸÑ ÿØŸàÿßŸÑ ŸÖÿÆÿµÿµÿ© ŸÖŸÉÿ™Ÿàÿ®ÿ© ÿ®ÿ•ŸäÿØŸÉ

ÿ®ÿ™ÿ¥ÿ™ÿ∫ŸÑ ÿπŸÑŸâ ÿ£ŸÉÿ™ÿ± ŸÖŸÜ ÿπŸÖŸàÿØ

In [56]:
print(df["age"].agg("mean"))  #ŸÖÿπ ÿØÿßŸÑÿ© ÿ¨ÿßŸáÿ≤ÿ©
print("_"*50)
print(df["age"].agg(["mean", "median", "std"])) #ŸÖÿπ ÿ£ŸÉÿ´ÿ± ŸÖŸÜ ÿØÿßŸÑÿ©
print("_"*50)
print(df[["age", "sex"]].agg(["mean", "median", "max"]))

54.366336633663366
__________________________________________________
mean      54.366337
median    55.000000
std        9.082101
Name: age, dtype: float64
__________________________________________________
              age       sex
mean    54.366337  0.683168
median  55.000000  1.000000
max     77.000000  1.000000

In [59]:
def pct30(column):
    return column.quantile(0.3)
    # ŸáŸÜÿß ÿ®ŸÜÿ≠ÿ≥ÿ® ÿßŸÑŸÇŸäŸÖÿ© ÿßŸÑŸÑŸä 30% ŸÖŸÜ ÿßŸÑÿ®ŸäÿßŸÜÿßÿ™ ÿ£ŸÇŸÑ ŸÖŸÜŸáÿß.

def pct90(col):
    return col.quantile(0.9)

print(df["age"].agg(pct30))  # ÿπŸÑŸä ÿØÿßŸÑŸá ŸÖÿÆÿµÿµŸá
print("_"*50)
print(df[["age", "fbs"]].agg(pct30))
print("_"*50)
print(df[["age", "fbs"]].agg([pct30, pct90 ]))

50.0
__________________________________________________
age    50.0
fbs     0.0
dtype: float64
__________________________________________________
        age  fbs
pct30  50.0  0.0
pct90  66.0  1.0

## **üîÅ 7. Cumulative Sum ‚Äì ÿßŸÑÿ¨ŸÖÿπ ÿßŸÑÿ™ÿ±ÿßŸÉŸÖŸä**

In [61]:
display(df["age"].cumsum().head())
print("_"*50)
display(df["age"].cummax().head()) #  ÿ£ŸÇÿµŸâ ŸÇŸäŸÖÿ© ÿ∏Ÿáÿ±ÿ™ ŸÖŸÜ ÿ£ŸàŸÑ ÿµŸÅ ŸÑÿ≠ÿØ ÿßŸÑÿµŸÅ ÿßŸÑÿ≠ÿßŸÑŸä
print("_"*50)
display(df["age"].cummin().head()) # ÿ£ŸÇŸÑ ŸÇŸäŸÖÿ© ÿ∏Ÿáÿ±ÿ™ ŸÑÿ≠ÿØ ŸÉŸÑ ÿµŸÅ
print("_"*50)
display(df["age"].cumprod().head()) # ÿ≠ÿßÿµŸÑ ÿ∂ÿ±ÿ® ÿßŸÑŸÇŸäŸÖ ŸÑÿ≠ÿØ ŸÉŸÑ ÿµŸÅ

0     63
1    100
2    141
3    197
4    254
Name: age, dtype: int64

__________________________________________________

0    63
1    63
2    63
3    63
4    63
Name: age, dtype: int64

__________________________________________________

0    63
1    37
2    37
3    37
4    37
Name: age, dtype: int64

__________________________________________________

0           63
1         2331
2        95571
3      5351976
4    305062632
Name: age, dtype: int64

## **Counting & Categorical Summaries in pandas**

 ÿßŸÜÿß ÿßŸÑŸàŸÇÿ™Ÿä ÿπÿßŸäÿ≤ ÿßÿπÿØ ÿßŸÑŸÅŸäÿ¶ÿßÿ™ ÿßŸÑÿπŸÖÿ±ŸäŸá
 ŸäÿπŸÜŸä ÿßÿπÿ±ŸÅ ŸÉŸÑ ÿπŸÖÿ± ŸÅŸäŸá ŸÖŸÜŸá ŸÉÿßŸÖ Ÿàÿßÿ≠ÿØ ŸÖŸàÿ¨ŸàÿØ ŸÖÿπÿßŸäÿß

In [64]:
display(df.drop_duplicates(subset=['age', 'sex'], ignore_index=True ))

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,old_people,man_2
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1,True,2
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1,False,2
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1,False,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1,False,2
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1,False,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
68,67,1,0,160,286,0,0,108,1,1.5,1,3,2,0,True,1
69,60,1,0,130,206,0,0,132,1,2.4,1,2,3,0,False,1
70,61,0,0,130,330,0,0,169,0,0.0,2,0,2,0,True,0
71,77,1,0,125,304,0,0,162,1,0.0,2,3,2,0,True,1
72,59,0,0,174,249,0,1,143,1,0.0,1,0,2,0,False,0

In [67]:
print(new_data["age"].value_counts().head())  #ÿ®ÿπÿØ ŸÉŸÑ ÿπŸÖÿ± ŸÖÿ™ÿ™ŸÉÿ±ÿ±ŸÉÿßŸÖ ŸÖÿ±Ÿá  ÿØÿß ÿßŸÑŸàÿ∂ÿπ
print(new_data["age"].value_counts(sort=False).head()) # ÿØÿß ÿßŸÑŸàÿ∂ÿπ ÿßŸÑÿßŸÅÿ™ÿ±ÿßÿ∂Ÿä

age
58    19
57    17
54    16
59    14
52    13
Name: count, dtype: int64
age
29    1
34    2
35    4
37    2
38    3
Name: count, dtype: int64

In [68]:
display(new_data["age"].value_counts(sort=True, normalize=True).head()) #ÿßŸÑŸÜÿ≥ÿ® ÿßŸÑŸÖÿ¶ŸàŸäÿ©

age
58    0.062706
57    0.056106
54    0.052805
59    0.046205
52    0.042904
Name: proportion, dtype: float64

In [70]:
unique_ages = df.drop_duplicates(subset=["age", "sex"])
age_counts = unique_ages["age"].value_counts()

print(age_counts)  # ÿßŸÇÿµŸä ÿ™ŸÉÿ±ÿßÿ± ŸáŸäŸÉŸàŸÜ ÿßÿ™ŸÜŸäŸÜ M & F

age
63    2
37    2
41    2
56    2
57    2
44    2
52    2
54    2
48    2
49    2
64    2
58    2
50    2
66    2
43    2
69    2
59    2
42    2
61    2
65    2
51    2
53    2
46    2
39    2
45    2
68    2
35    2
62    2
34    2
55    2
60    2
67    2
71    1
40    1
47    1
29    1
74    1
76    1
70    1
38    1
77    1
Name: count, dtype: int64

In [72]:
target_age = new_data[new_data["target"] == 1].drop_duplicates(subset=["age"], ignore_index=True)
display(target_age.head())
print(target_age["age"].value_counts())  # ÿπÿØÿØ ÿßŸÑÿπŸÖÿßÿ± ÿßŸÑŸÑŸä ÿπŸÜÿØŸáÿß ŸÉŸÜÿ≥ÿ±

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,old_people,man_2
0,29,1,1,130,204,0,0,202,0,0.0,2,0,2,1,False,2
1,34,1,3,118,182,0,0,174,0,0.0,2,0,2,1,False,2
2,35,1,1,122,192,0,1,174,0,0.0,2,0,2,1,False,2
3,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1,False,2
4,38,1,2,138,175,0,1,173,0,0.0,2,4,2,1,False,2

age
29    1
34    1
35    1
37    1
38    1
39    1
40    1
41    1
42    1
43    1
44    1
45    1
46    1
47    1
48    1
49    1
50    1
51    1
52    1
53    1
54    1
55    1
56    1
57    1
58    1
59    1
60    1
61    1
62    1
63    1
64    1
65    1
66    1
67    1
68    1
69    1
70    1
71    1
74    1
76    1
Name: count, dtype: int64

## **Grouped Summary Statistics**

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("../Other/heart.csv")
display(df.head())

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

In [4]:
display(df.groupby("age").sum().head())
# ŸäŸÇÿ≥ŸÖ ÿßŸÑÿ®ŸäÿßŸÜÿßÿ™ ÿ•ŸÑŸâ ŸÖÿ¨ŸÖŸàÿπÿßÿ™ ÿ≠ÿ≥ÿ® ÿßŸÑÿπŸÖÿ±.
#  ÿßÿ≠ÿ≥ÿ® ŸÖÿ¨ŸÖŸàÿπ ÿßŸÑŸÇŸäŸÖ ÿßŸÑÿ±ŸÇŸÖŸäÿ© ŸÅŸä ŸÉŸÑ ŸÖÿ¨ŸÖŸàÿπÿ©

,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
age,,,,,,,,,,,,,
29,1,1,130,204,0,0,202,0,0.0,2,0,2,1
34,1,4,236,392,0,1,366,0,0.7,4,0,4,2
35,3,1,506,855,0,3,642,2,3.0,7,0,10,2
37,1,4,250,465,0,2,357,0,3.5,2,0,4,2
38,3,7,396,581,0,3,528,1,3.8,5,8,7,2

In [5]:
display(df.groupby("age")["target"].mean().head())
# groupby("age") ŸÇÿ≥ŸÖ ÿßŸÑÿ®ŸäÿßŸÜÿßÿ™ ÿ≠ÿ≥ÿ® ÿßŸÑŸÅŸäÿ°ÿ© ÿßŸÑÿπŸÖÿ±Ÿäÿ©
# ["target"] ÿßÿ¥ÿ™ÿ∫ŸÑ ÿπ ÿßŸÑÿπŸÖŸàÿØ ÿßŸÑŸÜÿ™Ÿäÿ¨Ÿá
#

age
29    1.000000
34    1.000000
35    0.500000
37    1.000000
38    0.666667
Name: target, dtype: float64

In [6]:
display(df.groupby("age")["target"].agg(["max", "min", "sum"]).head())

     max  min  sum
age
29     1    1    1
34     1    1    2
35     1    0    2
37     1    1    2
38     1    0    2

In [8]:
data_2 = df.groupby(["age", "sex"])["target"].mean().head()

In [14]:
data_2.index.get_level_values(0)

Index([29, 34, 34, 35, 35], dtype='int64', name='age')

In [15]:
data_2.index.get_level_values('age')

Index([29, 34, 34, 35, 35], dtype='int64', name='age')

In [81]:
df.groupby(["age", "sex"])[["chol", "trestbps"]].agg(["min", "max", "mean"]).head()

        chol             trestbps
         min  max   mean      min  max        mean
age sex
29  1    204  204  204.0      130  130  130.000000
34  0    210  210  210.0      118  118  118.000000
    1    182  182  182.0      118  118  118.000000
35  0    183  183  183.0      138  138  138.000000
    1    192  282  224.0      120  126  122.666667

In [2]:
import pandas as pd
df = pd.read_csv("locations.csv")
df.head()

,location,continent,population,life_expectancy,hospital_beds_per_thousand,gdp_per_capita
0,Afghanistan,Asia,38928341.0,64.83,0.50,1803.987
1,Albania,Europe,2877800.0,78.57,2.89,11803.431
2,Algeria,Africa,43851043.0,76.88,1.90,13913.839
3,Andorra,Europe,77265.0,83.73,NaN,NaN
4,Angola,Africa,32866268.0,61.15,NaN,5819.495

In [4]:
continent_summary = df.groupby("continent").agg(
    # Create the mean_life_expectancy column
    mean_life_expectancy=("life_expectancy", "mean"),
    # Create the std_life_expectancy column
    std_life_expectany=("life_expectancy", "std")
)
print(continent_summary)

               mean_life_expectancy  std_life_expectany
continent
Africa                    64.225636            5.945353
Asia                      74.596809            4.926393
Europe                    79.779167            3.553759
North America             76.683333            3.879135
Oceania                   76.211250            6.786066
South America             75.579231            3.495286

## **Pivot tables**

ŸÜŸÅÿ≥ ŸÅŸÉÿ±ÿ© groupby()ÿå ÿ®ÿ≥ ÿßŸÑŸÜÿ™Ÿäÿ¨ÿ© ÿ®ÿ™ÿ™ÿ±ÿ™ÿ® ÿπŸÑŸâ ÿ¥ŸÉŸÑ ÿ¨ÿØŸàŸÑ 2D (ÿµŸÅŸàŸÅ √ó ÿ£ÿπŸÖÿØÿ©).

Ÿàÿ®ÿ™ÿØŸäŸÉ ŸÖÿ±ŸàŸÜÿ© ÿ£ŸÉÿ®ÿ± ŸÅŸä ÿßŸÑÿ™ŸÑÿÆŸäÿµÿå ŸàÿÆÿµŸàÿµŸãÿß ŸÑŸà ÿπŸÜÿØŸÉ ŸÖÿ¨ŸÖŸàÿπÿ™ŸäŸÜ ŸÖŸÜ ÿßŸÑÿ®ŸäÿßŸÜÿßÿ™ (index Ÿà columns).

In [83]:
display(new_data.pivot_table(values='target', index='age').head())

# df.groupby("age")["target"].mean()

#ÿßŸÑÿπŸÜÿµÿ± 	ŸÖÿπŸÜÿßŸá
# values	ÿßŸÑÿπŸÖŸàÿØ ÿßŸÑŸÑŸä Ÿáÿ™ŸÑÿÆŸëÿµŸá (ÿßŸÑŸÑŸä ÿπÿßŸäÿ≤ ÿ™ÿ≠ÿ≥ÿ® ŸÑŸá ÿßŸÑŸÖÿ™Ÿàÿ≥ÿ∑ ŸÖÿ´ŸÑÿßŸã)
# index 	      ÿßŸÑÿπŸÖŸàÿØ ÿßŸÑŸÑŸä Ÿáÿ™ŸÇÿ≥ŸÖ ÿßŸÑÿ®ŸäÿßŸÜÿßÿ™ ÿ®ŸÜÿßÿ°Ÿã ÿπŸÑŸäŸá (ÿßŸÑŸÖÿ¨ŸÖŸàÿπÿ©)
# aggfunc	ŸÜŸàÿπ ÿßŸÑÿ•ÿ≠ÿµÿßÿ¶Ÿäÿ© (ÿßŸÅÿ™ÿ±ÿßÿ∂Ÿä = "mean"ÿå ŸÑŸÉŸÜ ŸÖŸÖŸÉŸÜ ÿ™ÿ≥ÿ™ÿÆÿØŸÖ "sum", "median"...)

       target
age
29   1.000000
34   1.000000
35   0.500000
37   1.000000
38   0.666667

In [85]:
new_data.pivot_table(values="target", index="age", aggfunc="median").head()

     target
age
29      1.0
34      1.0
35      0.5
37      1.0
38      1.0

In [86]:
df.pivot_table(values="target", index="age", aggfunc=["median", "mean"]).head()

    median      mean
    target    target
age
29     1.0  1.000000
34     1.0  1.000000
35     0.5  0.500000
37     1.0  1.000000
38     1.0  0.666667

In [91]:
new_data.pivot_table(values="target", index="age", columns="sex", fill_value=-1).head()

sex    0         1
age
29  -1.0  1.000000
34   1.0  1.000000
35   1.0  0.333333
37   1.0  1.000000
38  -1.0  0.666667

In [93]:
df.pivot_table(values="target", index="age", columns="sex", fill_value=0,margins=True )

#   ‚úÖ ÿµŸÅ "All" = ÿ•ÿ¨ŸÖÿßŸÑŸä ÿßŸÑŸÖÿ™Ÿàÿ≥ÿ∑ÿßÿ™ ÿπÿ®ÿ± ÿßŸÑÿ£ÿπŸÖÿßÿ±(ÿßÿ¨ŸÖÿßŸÑŸä ŸÖÿ™Ÿàÿ≥ÿ∑ ÿßÿπŸÖÿßÿ± ÿßŸÑÿ∞ŸÉŸàÿ± Ÿà ÿßŸÑÿßŸÜÿßÿ´)
#   ‚úÖ ÿπŸÖŸàÿØ "All" = ÿ•ÿ¨ŸÖÿßŸÑŸä ÿßŸÑŸÖÿ™Ÿàÿ≥ÿ∑ÿßÿ™ ÿπÿ®ÿ± ÿßŸÑŸÜŸàÿπ
#   ‚úÖ ÿßŸÑÿ≤ÿßŸàŸäÿ© ÿßŸÑÿ≥ŸÅŸÑŸäÿ© ÿßŸÑŸäŸÖŸÜŸâ = ÿßŸÑŸÖÿ™Ÿàÿ≥ÿ∑ ÿßŸÑÿπÿßŸÖ ŸÑŸÉŸÑ ÿßŸÑŸÇŸäŸÖ ŸÅŸä ÿßŸÑÿ¨ÿØŸàŸÑ

sex         0         1       All
age
29   0.000000  1.000000  1.000000
34   1.000000  1.000000  1.000000
35   1.000000  0.333333  0.500000
37   1.000000  1.000000  1.000000
38   0.000000  0.666667  0.666667
39   1.000000  0.500000  0.750000
40   0.000000  0.333333  0.333333
41   1.000000  0.833333  0.900000
42   1.000000  0.833333  0.875000
43   0.500000  0.666667  0.625000
44   1.000000  0.666667  0.727273
45   1.000000  0.600000  0.750000
46   1.000000  0.250000  0.571429
47   0.000000  0.600000  0.600000
48   1.000000  0.500000  0.571429
49   1.000000  0.333333  0.600000
50   1.000000  0.250000  0.571429
51   0.750000  0.750000  0.750000
52   1.000000  0.666667  0.692308
53   1.000000  0.600000  0.750000
54   1.000000  0.454545  0.625000
55   0.500000  0.250000  0.375000
56   0.333333  0.500000  0.454545
57   0.500000  0.384615  0.411765
58   0.666667  0.230769  0.368421
59   0.000000  0.384615  0.357143
60   0.750000  0.000000  0.272727
61   0.000000  0.166667  0.125000
62   0.285714  0.500000  0.363636
63   0.400000  0.250000  0.333333
64   1.000000  0.428571  0.600000
65   0.750000  0.250000  0.500000
66   0.666667  0.500000  0.571429
67   1.000000  0.000000  0.333333
68   1.000000  0.333333  0.500000
69   1.000000  0.500000  0.666667
70   0.000000  0.250000  0.250000
71   1.000000  0.000000  1.000000
74   1.000000  0.000000  1.000000
76   1.000000  0.000000  1.000000
77   0.000000  0.000000  0.000000
All  0.750000  0.449275  0.544554

# Slicing and Indexing DataFram

In [94]:
import pandas as pd

df = pd.read_csv("../Other/pokemon.csv")
df.head()

,id,species,generation_id,height,weight,base_experience,type_1,type_2,hp,attack,defense,speed,special-attack,special-defense
0,1,bulbasaur,1,0.7,6.9,64,grass,poison,45,49,49,45,65,65
1,2,ivysaur,1,1.0,13.0,142,grass,poison,60,62,63,60,80,80
2,3,venusaur,1,2.0,100.0,236,grass,poison,80,82,83,80,100,100
3,4,charmander,1,0.6,8.5,62,fire,NaN,39,52,43,65,60,50
4,5,charmeleon,1,1.1,19.0,142,fire,NaN,58,64,58,80,80,65

ÿßŸÑŸÖŸÉŸàŸÜ  	Ÿàÿ∏ŸäŸÅÿ™Ÿá

.values 	ÿßŸÑŸÖÿµŸÅŸàŸÅÿ© ÿßŸÑŸÅÿπŸÑŸäÿ© ŸÑŸÑÿ®ŸäÿßŸÜÿßÿ™ (NumPy)

.columns	ÿ£ÿ≥ŸÖÿßÿ° ÿßŸÑÿ£ÿπŸÖÿØÿ© (ÿßŸÑŸÅŸáÿ±ÿ≥ ÿßŸÑÿ£ŸÅŸÇŸä)

.index  	  ÿ£ÿ±ŸÇÿßŸÖ ÿ£Ÿà ÿ£ÿ≥ŸÖÿßÿ° ÿßŸÑÿµŸÅŸàŸÅ (ÿßŸÑŸÅŸáÿ±ÿ≥ ÿßŸÑÿ±ÿ£ÿ≥Ÿä)

In [115]:
df.isna().sum()

species              0
generation_id        0
height               0
weight               0
base_experience      0
type_1               0
type_2             402
hp                   0
attack               0
defense              0
speed                0
special-attack       0
special-defense      0
dtype: int64

## **explicit indexes**

In [95]:
df.set_index("id", inplace=True)  # ÿßŸÑ id ÿØÿß ÿßŸÑÿπŸÖŸàÿØ ÿßŸÑŸÑŸä ŸáŸäÿ®ŸÇÿß ŸÖŸÉÿßŸÜ ÿßŸÑindex
                                  # inplace=True ŸäÿπŸÜŸä ÿßŸÑÿ¥ÿ∫ŸÑ ÿπ ŸÜŸÅÿ≥ ÿßŸÑÿØÿßÿ™ÿß ŸÖÿ¥ ŸÜÿ≥ÿÆŸá ŸÖŸÜŸáÿß
df.head()

,species,generation_id,height,weight,base_experience,type_1,type_2,hp,attack,defense,speed,special-attack,special-defense
id,,,,,,,,,,,,,
1,bulbasaur,1,0.7,6.9,64,grass,poison,45,49,49,45,65,65
2,ivysaur,1,1.0,13.0,142,grass,poison,60,62,63,60,80,80
3,venusaur,1,2.0,100.0,236,grass,poison,80,82,83,80,100,100
4,charmander,1,0.6,8.5,62,fire,NaN,39,52,43,65,60,50
5,charmeleon,1,1.1,19.0,142,fire,NaN,58,64,58,80,80,65

In [96]:
df1 = df.reset_index(inplace=False)    # index ÿ±ÿ¨ÿπŸÑŸä ÿßŸÑ
df1.head()

,id,species,generation_id,height,weight,base_experience,type_1,type_2,hp,attack,defense,speed,special-attack,special-defense
0,1,bulbasaur,1,0.7,6.9,64,grass,poison,45,49,49,45,65,65
1,2,ivysaur,1,1.0,13.0,142,grass,poison,60,62,63,60,80,80
2,3,venusaur,1,2.0,100.0,236,grass,poison,80,82,83,80,100,100
3,4,charmander,1,0.6,8.5,62,fire,NaN,39,52,43,65,60,50
4,5,charmeleon,1,1.1,19.0,142,fire,NaN,58,64,58,80,80,65

In [97]:
df2 = df.reset_index(drop=True, inplace=False)   # ŸáŸÜÿß ŸáŸà ŸÖÿ≥ÿ≠ ÿßŸÑÿßŸÜÿØŸÉÿ≥ ÿßŸÑŸÇÿØŸäŸÖ id Ÿàÿ≠ÿ∑Ÿá ÿßŸÑÿØÿßÿ™ÿß ŸÅŸä ŸÜÿ≥ÿÆŸá ÿ™ÿßŸÜŸäŸá
df2.head()

,species,generation_id,height,weight,base_experience,type_1,type_2,hp,attack,defense,speed,special-attack,special-defense
0,bulbasaur,1,0.7,6.9,64,grass,poison,45,49,49,45,65,65
1,ivysaur,1,1.0,13.0,142,grass,poison,60,62,63,60,80,80
2,venusaur,1,2.0,100.0,236,grass,poison,80,82,83,80,100,100
3,charmander,1,0.6,8.5,62,fire,NaN,39,52,43,65,60,50
4,charmeleon,1,1.1,19.0,142,fire,NaN,58,64,58,80,80,65

In [99]:
df.head()

,species,generation_id,height,weight,base_experience,type_1,type_2,hp,attack,defense,speed,special-attack,special-defense
id,,,,,,,,,,,,,
1,bulbasaur,1,0.7,6.9,64,grass,poison,45,49,49,45,65,65
2,ivysaur,1,1.0,13.0,142,grass,poison,60,62,63,60,80,80
3,venusaur,1,2.0,100.0,236,grass,poison,80,82,83,80,100,100
4,charmander,1,0.6,8.5,62,fire,NaN,39,52,43,65,60,50
5,charmeleon,1,1.1,19.0,142,fire,NaN,58,64,58,80,80,65

In [100]:
df['species'][100]

'voltorb'

In [101]:
df.at[99, 'species']

'kingler'

In [102]:
df.loc[[1, 2]]

,species,generation_id,height,weight,base_experience,type_1,type_2,hp,attack,defense,speed,special-attack,special-defense
id,,,,,,,,,,,,,
1,bulbasaur,1,0.7,6.9,64,grass,poison,45,49,49,45,65,65
2,ivysaur,1,1.0,13.0,142,grass,poison,60,62,63,60,80,80

In [104]:
df.loc[:10, 'type_1']

id
1     grass
2     grass
3     grass
4      fire
5      fire
6      fire
7     water
8     water
9     water
10      bug
Name: type_1, dtype: object

In [106]:
df.iloc[0:10 , 1:4]

    generation_id  height  weight
id
1               1     0.7     6.9
2               1     1.0    13.0
3               1     2.0   100.0
4               1     0.6     8.5
5               1     1.1    19.0
6               1     1.7    90.5
7               1     0.5     9.0
8               1     1.0    22.5
9               1     1.6    85.5
10              1     0.3     2.9

In [111]:
df3 = df.set_index("type_1", inplace=False)

display(df3.loc["fire"].head())
print("number of fire: ",len(df3.loc["fire"]))

,species,generation_id,height,weight,base_experience,type_2,hp,attack,defense,speed,special-attack,special-defense
type_1,,,,,,,,,,,,
fire,charmander,1,0.6,8.5,62,NaN,39,52,43,65,60,50
fire,charmeleon,1,1.1,19.0,142,NaN,58,64,58,80,80,65
fire,charizard,1,1.7,90.5,240,flying,78,84,78,100,109,85
fire,vulpix,1,0.6,9.9,60,NaN,38,41,40,65,50,65
fire,ninetales,1,1.1,19.9,177,NaN,73,76,75,100,81,100

number of fire:  53

Multi-level Index

In [113]:
df4 = df.set_index(["type_1", "type_2"], inplace=False)

#ÿßŸÑŸÖÿ≥ÿ™ŸàŸâ ÿßŸÑÿ£ŸàŸÑ ŸÑŸÑŸÅŸáÿ±ÿ≥: type_1
#ÿßŸÑŸÖÿ≥ÿ™ŸàŸâ ÿßŸÑÿ´ÿßŸÜŸä: type_2

df4.loc[["fire", "grass"]]  #  ÿ™ÿµŸÅŸäÿ© ÿπŸÑŸâ ÿßŸÑŸÖÿ≥ÿ™ŸàŸâ ÿßŸÑÿÆÿßÿ±ÿ¨Ÿä

                  species  generation_id  height  weight  base_experience  hp  \
type_1 type_2
fire   NaN     charmander              1     0.6     8.5               62  39
       NaN     charmeleon              1     1.1    19.0              142  58
       flying   charizard              1     1.7    90.5              240  78
       NaN         vulpix              1     0.6     9.9               60  38
       NaN      ninetales              1     1.1    19.9              177  73
...                   ...            ...     ...     ...              ...  ..
grass  NaN      bounsweet              7     0.3     3.2               42  42
       NaN        steenee              7     0.7     8.2              102  52
       NaN       tsareena              7     1.2    21.4              230  72
       fairy    tapu-bulu              7     1.9    45.5              257  70
       steel      kartana              7     0.3     0.1              257  59

               attack  defense  speed  special-attack  special-defense
type_1 type_2
fire   NaN         52       43     65              60               50
       NaN         64       58     80              80               65
       flying      84       78    100             109               85
       NaN         41       40     65              50               65
       NaN         76       75    100              81              100
...               ...      ...    ...             ...              ...
grass  NaN         30       38     32              30               38
       NaN         40       48     62              40               48
       NaN        120       98     72              50               98
       fairy      130      115     75              85               95
       steel      181      131    109              59               31

[131 rows x 11 columns]

In [116]:
df4.loc[[("water", "fighting"), ("grass", "poison")]]  #  ÿ™ÿµŸÅŸäÿ© ÿπŸÑŸâ ÿßŸÑŸÖÿ≥ÿ™ŸàŸâ ÿßŸÑÿØÿßÿÆŸÑŸä

                    species  generation_id  height  weight  base_experience  \
type_1 type_2
water  fighting   poliwrath              1     1.3    54.0              230
       fighting      keldeo              5     1.4    48.5              261
grass  poison     bulbasaur              1     0.7     6.9               64
       poison       ivysaur              1     1.0    13.0              142
       poison      venusaur              1     2.0   100.0              236
       poison        oddish              1     0.5     5.4               64
       poison         gloom              1     0.8     8.6              138
       poison     vileplume              1     1.2    18.6              221
       poison    bellsprout              1     0.7     4.0               60
       poison    weepinbell              1     1.0     6.4              137
       poison    victreebel              1     1.7    15.5              221
       poison       roselia              3     0.3     2.0              140
       poison         budew              4     0.2     1.2               56
       poison      roserade              4     0.9    14.5              232
       poison       foongus              5     0.2     1.0               59
       poison     amoonguss              5     0.6    10.5              162

                  hp  attack  defense  speed  special-attack  special-defense
type_1 type_2
water  fighting   90      95       95     70              70               90
       fighting   91      72       90    108             129               90
grass  poison     45      49       49     45              65               65
       poison     60      62       63     60              80               80
       poison     80      82       83     80             100              100
       poison     45      50       55     30              75               65
       poison     60      65       70     40              85               75
       poison     75      80       85     50             110               90
       poison     50      75       35     40              70               30
       poison     65      90       50     55              85               45
       poison     80     105       65     70             100               70
       poison     50      60       45     65             100               80
       poison     40      30       35     55              50               70
       poison     60      70       65     90             125              105
       poison     69      55       45     15              55               55
       poison    114      85       70     30              85               80

In [117]:
df4.sort_index()   # ÿ™ÿ±ÿ™Ÿäÿ® ÿßŸÑŸÄ Index:

                    species  generation_id  height  weight  base_experience  \
type_1 type_2
bug    electric      joltik              5     0.1     0.6               64
       electric  galvantula              5     0.8    14.3              165
       electric   charjabug              7     0.5    10.5              140
       electric    vikavolt              7     1.5    45.0              225
       fairy       cutiefly              7     0.1     0.2               61
...                     ...            ...     ...     ...              ...
water  NaN        clawitzer              6     1.3    35.3              100
       NaN          popplio              7     0.4     7.5               64
       NaN          brionne              7     0.6    17.5              147
       NaN       wishiwashi              7     0.2     0.3               61
       NaN        pyukumuku              7     0.3     1.2              144

                 hp  attack  defense  speed  special-attack  special-defense
type_1 type_2
bug    electric  50      47       50     65              57               50
       electric  70      77       60    108              97               60
       electric  57      82       95     36              55               75
       electric  77      70       90     43             145               75
       fairy     40      45       40     84              55               40
...              ..     ...      ...    ...             ...              ...
water  NaN       71      73       88     59             120               89
       NaN       50      54       54     40              66               56
       NaN       60      69       69     50              91               81
       NaN       45      20       20     40              25               25
       NaN       55      60      130      5              30              130

[807 rows x 11 columns]

In [118]:
df4.sort_index(level=["type_1", "type_2"], ascending=[True, False])

                  species  generation_id  height  weight  base_experience  hp  \
type_1 type_2
bug    water      surskit              3     0.5     1.7               54  40
       water       wimpod              7     0.5    12.0               46  25
       water    golisopod              7     2.0   108.0              186  75
       steel   forretress              2     1.2   125.8              163  75
       steel       scizor              2     1.8   118.0              175  70
...                   ...            ...     ...     ...              ...  ..
water  NaN      clawitzer              6     1.3    35.3              100  71
       NaN        popplio              7     0.4     7.5               64  50
       NaN        brionne              7     0.6    17.5              147  60
       NaN     wishiwashi              7     0.2     0.3               61  45
       NaN      pyukumuku              7     0.3     1.2              144  55

               attack  defense  speed  special-attack  special-defense
type_1 type_2
bug    water       30       32     65              50               52
       water       35       40     80              20               30
       water      125      140     40              60               90
       steel       90      140     40              60               60
       steel      130      100     65              55               80
...               ...      ...    ...             ...              ...
water  NaN         73       88     59             120               89
       NaN         54       54     40              66               56
       NaN         69       69     50              91               81
       NaN         20       20     40              25               25
       NaN         60      130      5              30              130

[807 rows x 11 columns]

**Slicing & Subsetting with .loc  .iloc**

In [119]:
df4.sort_index(level=["type_1", "type_2"], ascending=[True, False], inplace=True)

# ŸÇÿ®ŸÑ ŸÖÿß ÿ™ÿ≥ÿ™ÿÆÿØŸÖ .loc[] ŸÑŸÑÿ™ŸÇÿ∑Ÿäÿπÿå ŸÑÿßÿ≤ŸÖ ÿ™ÿ±ÿ™ÿ® ÿßŸÑŸÅŸáÿ±ÿ≥ ÿ®ÿßÿ≥ÿ™ÿÆÿØÿßŸÖ sort_index()
# inplace=True ÿπÿ¥ÿßŸÜ ÿßÿ´ÿ®ÿ™ ÿßŸÑÿ™ÿ±ÿ™Ÿäÿ® ŸÅŸä df4

df4.loc["bug" : "electric"]

                    species  generation_id  height  weight  base_experience  \
type_1   type_2
bug      water      surskit              3     0.5     1.7               54
         water       wimpod              7     0.5    12.0               46
         water    golisopod              7     2.0   108.0              186
         steel   forretress              2     1.2   125.8              163
         steel       scizor              2     1.8   118.0              175
...                     ...            ...     ...     ...              ...
electric NaN         tynamo              5     0.2     0.3               55
         NaN      eelektrik              5     1.2    22.0              142
         NaN     eelektross              5     2.1    80.5              232
         NaN      xurkitree              7     3.8   100.0              257
         NaN        zeraora              7     1.5    44.5              270

                 hp  attack  defense  speed  special-attack  special-defense
type_1   type_2
bug      water   40      30       32     65              50               52
         water   25      35       40     80              20               30
         water   75     125      140     40              60               90
         steel   75      90      140     40              60               60
         steel   70     130      100     65              55               80
...              ..     ...      ...    ...             ...              ...
electric NaN     35      55       40     60              45               40
         NaN     65      85       70     40              75               70
         NaN     85     115       80     50             105               80
         NaN     83      89       71     83             173               71
         NaN     88     112       75    143             102               80

[168 rows x 11 columns]

In [121]:
df5 = df.set_index(["type_1", "type_2"], inplace=False)
print(df5.head())
df5.sort_index(level=["type_1", "type_2"], ascending=[True, True], inplace=True)
df5

                  species  generation_id  height  weight  base_experience  hp  \
type_1 type_2
grass  poison   bulbasaur              1     0.7     6.9               64  45
       poison     ivysaur              1     1.0    13.0              142  60
       poison    venusaur              1     2.0   100.0              236  80
fire   NaN     charmander              1     0.6     8.5               62  39
       NaN     charmeleon              1     1.1    19.0              142  58

               attack  defense  speed  special-attack  special-defense
type_1 type_2
grass  poison      49       49     45              65               65
       poison      62       63     60              80               80
       poison      82       83     80             100              100
fire   NaN         52       43     65              60               50
       NaN         64       58     80              80               65

                    species  generation_id  height  weight  base_experience  \
type_1 type_2
bug    electric      joltik              5     0.1     0.6               64
       electric  galvantula              5     0.8    14.3              165
       electric   charjabug              7     0.5    10.5              140
       electric    vikavolt              7     1.5    45.0              225
       fairy       cutiefly              7     0.1     0.2               61
...                     ...            ...     ...     ...              ...
water  NaN        clawitzer              6     1.3    35.3              100
       NaN          popplio              7     0.4     7.5               64
       NaN          brionne              7     0.6    17.5              147
       NaN       wishiwashi              7     0.2     0.3               61
       NaN        pyukumuku              7     0.3     1.2              144

                 hp  attack  defense  speed  special-attack  special-defense
type_1 type_2
bug    electric  50      47       50     65              57               50
       electric  70      77       60    108              97               60
       electric  57      82       95     36              55               75
       electric  77      70       90     43             145               75
       fairy     40      45       40     84              55               40
...              ..     ...      ...    ...             ...              ...
water  NaN       71      73       88     59             120               89
       NaN       50      54       54     40              66               56
       NaN       60      69       69     50              91               81
       NaN       45      20       20     40              25               25
       NaN       55      60      130      5              30              130

[807 rows x 11 columns]

In [122]:
df5.loc["bug" : "electric"]

                      species  generation_id  height  weight  base_experience  \
type_1   type_2
bug      electric      joltik              5     0.1     0.6               64
         electric  galvantula              5     0.8    14.3              165
         electric   charjabug              7     0.5    10.5              140
         electric    vikavolt              7     1.5    45.0              225
         fairy       cutiefly              7     0.1     0.2               61
...                       ...            ...     ...     ...              ...
electric NaN           tynamo              5     0.2     0.3               55
         NaN        eelektrik              5     1.2    22.0              142
         NaN       eelektross              5     2.1    80.5              232
         NaN        xurkitree              7     3.8   100.0              257
         NaN          zeraora              7     1.5    44.5              270

                   hp  attack  defense  speed  special-attack  special-defense
type_1   type_2
bug      electric  50      47       50     65              57               50
         electric  70      77       60    108              97               60
         electric  57      82       95     36              55               75
         electric  77      70       90     43             145               75
         fairy     40      45       40     84              55               40
...                ..     ...      ...    ...             ...              ...
electric NaN       35      55       40     60              45               40
         NaN       65      85       70     40              75               70
         NaN       85     115       80     50             105               80
         NaN       83      89       71     83             173               71
         NaN       88     112       75    143             102               80

[168 rows x 11 columns]

In [123]:
#df5.loc[("bug" , "electric") : ("bug" , "fairy")]
print(df5.index._lexsort_depth)  # ÿßŸÑŸÖŸÅÿ±Ÿàÿ∂ ÿØŸÑŸàŸÇÿ™Ÿä Ÿäÿ∑ŸÑÿπ 2
print("ÿπÿØÿØ ŸÖÿ≥ÿ™ŸàŸäÿßÿ™ ÿßŸÑŸÅŸáÿ±ÿ≥:", df5.index.nlevels)         # ŸÑÿßÿ≤ŸÖ ÿ™ŸÉŸàŸÜ 2
print("ÿπŸÖŸÇ ÿßŸÑÿ™ÿ±ÿ™Ÿäÿ® ÿßŸÑŸÅÿπŸÑŸä:", df5.index._lexsort_depth)   # ŸÑÿßÿ≤ŸÖ ÿ™ŸÉŸàŸÜ 2

1
ÿπÿØÿØ ŸÖÿ≥ÿ™ŸàŸäÿßÿ™ ÿßŸÑŸÅŸáÿ±ÿ≥: 2
ÿπŸÖŸÇ ÿßŸÑÿ™ÿ±ÿ™Ÿäÿ® ÿßŸÑŸÅÿπŸÑŸä: 1

In [127]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

df = pd.read_csv("fuel-econ.csv")
df.set_index(["year", "cylinders"], inplace=True)
df.sort_index(level=["year", "cylinders"], ascending=[True, True], inplace=True)
df

FileNotFoundError: [Errno 2] No such file or directory: '../fuel-econ.csv'

In [14]:
df.loc[2015: 2016]

                   id         make             model           VClass  \
year cylinders
2015 2          36030          BMW            i3 REX  Subcompact Cars
     3          34988   Mitsubishi            Mirage     Compact Cars
     3          34989   Mitsubishi            Mirage     Compact Cars
     3          35182         Ford    Fiesta SFE FWD  Subcompact Cars
     3          35793         MINI  Cooper (3-doors)  Subcompact Cars
...               ...          ...               ...              ...
2016 12         36907  Rolls-Royce             Ghost       Large Cars
     12         36908  Rolls-Royce         Ghost EWB       Large Cars
     12         36960      Ferrari                FF     Midsize Cars
     12         36961      Ferrari                FF     Midsize Cars
     12         37287  Rolls-Royce              Dawn     Compact Cars

                                  drive                             trans  \
year cylinders
2015 2                 Rear-Wheel Drive                    Automatic (A1)
     3                Front-Wheel Drive                      Manual 5-spd
     3                Front-Wheel Drive  Automatic (variable gear ratios)
     3                Front-Wheel Drive                      Manual 5-spd
     3                Front-Wheel Drive                    Automatic (S6)
...                                 ...                               ...
2016 12                Rear-Wheel Drive                    Automatic (S8)
     12                Rear-Wheel Drive                    Automatic (S8)
     12         Part-time 4-Wheel Drive                   Automatic (AM7)
     12         Part-time 4-Wheel Drive                   Automatic (AM7)
     12                Rear-Wheel Drive                    Automatic (S8)

                        fuelType  displ  pv2  pv4     city    UCity  highway  \
year cylinders
2015 2          Premium Gasoline    0.6    0   84  41.4544  52.5000  37.3180
     3          Regular Gasoline    1.2    0   86  33.1238  44.4503  40.7940
     3          Regular Gasoline    1.2    0   86  36.2941  49.4465  42.3508
     3          Regular Gasoline    1.0    0   85  31.0740  41.2990  41.0213
     3          Premium Gasoline    1.5    0    0  27.4963  35.9414  36.3242
...                          ...    ...  ...  ...      ...      ...      ...
2016 12         Premium Gasoline    6.6    0  111  12.5264  15.1000  20.9824
     12         Premium Gasoline    6.6    0  117  12.5264  15.1000  20.9824
     12         Premium Gasoline    6.3    0    0  10.8701  13.1973  16.5788
     12         Premium Gasoline    6.3    0    0  11.1489  13.5520  16.6631
     12         Premium Gasoline    6.6  100    0  12.2026  14.9000  18.8752

                UHighway     comb  co2  feScore  ghgScore
year cylinders
2015 2           52.2000  39.4850   40       10        10
     3           60.7107  36.1855  243        9         9
     3           63.3897  38.7905  228        9         9
     3           61.1000  34.8802  252        8         8
     3           53.1865  30.8727  287        8         8
...                  ...      ...  ...      ...       ...
2016 12          26.4000  15.3013  580        2         2
     12          26.4000  15.3013  580        2         2
     12          22.6600  12.8633  692        1         1
     12          22.7818  13.0996  679        1         1
     12          26.0000  14.5110  609        2         2

[1329 rows x 18 columns]

In [15]:
df.loc[(2015, 12) : (2016, 12)]

#ÿ™ÿ≥ÿ™ÿÆÿØŸÖ tuples ŸÑŸà ÿπŸÜÿØŸÉ ŸÅŸáÿ±ÿ≥ ŸÖŸÉŸàŸëŸÜ ŸÖŸÜ ÿ£ŸÉÿ™ÿ± ŸÖŸÜ ÿπŸÖŸàÿØ
# ÿßŸÑŸÖÿ≥ÿ™ŸàŸâ ÿßŸÑÿÆÿßÿ±ÿ¨Ÿä ÿßŸÑÿ£ŸàŸÑ (ÿ≤Ÿä: year)
# ÿßŸÑŸÖÿ≥ÿ™ŸàŸâ ÿßŸÑÿØÿßÿÆŸÑŸä ÿßŸÑÿ´ÿßŸÜŸä (ÿ≤Ÿä: cylinders)

                   id           make                       model  \
year cylinders
2015 12         34922        Bentley  Continental GT Convertible
     12         34923        Bentley              Continental GT
     12         34927        Bentley                 Flying Spur
     12         34929           Audi                        A8 L
     12         34956  Mercedes-Benz                        S600
...               ...            ...                         ...
2016 12         36907    Rolls-Royce                       Ghost
     12         36908    Rolls-Royce                   Ghost EWB
     12         36960        Ferrari                          FF
     12         36961        Ferrari                          FF
     12         37287    Rolls-Royce                        Dawn

                         VClass                    drive            trans  \
year cylinders
2015 12         Subcompact Cars          All-Wheel Drive   Automatic (S8)
     12            Compact Cars          All-Wheel Drive   Automatic (S8)
     12            Midsize Cars          All-Wheel Drive   Automatic (S8)
     12              Large Cars          All-Wheel Drive   Automatic (S8)
     12              Large Cars         Rear-Wheel Drive  Automatic 7-spd
...                         ...                      ...              ...
2016 12              Large Cars         Rear-Wheel Drive   Automatic (S8)
     12              Large Cars         Rear-Wheel Drive   Automatic (S8)
     12            Midsize Cars  Part-time 4-Wheel Drive  Automatic (AM7)
     12            Midsize Cars  Part-time 4-Wheel Drive  Automatic (AM7)
     12            Compact Cars         Rear-Wheel Drive   Automatic (S8)

                        fuelType  displ  pv2  pv4     city    UCity  highway  \
year cylinders
2015 12         Premium Gasoline    6.0   86    0  12.0228  14.4000  20.0478
     12         Premium Gasoline    6.0   89    0  12.4737  15.4000  21.0866
     12         Premium Gasoline    6.0  102    0  12.0228  14.4000  20.0478
     12         Premium Gasoline    6.3    0  107  13.8358  17.2000  21.9706
     12         Premium Gasoline    6.0    0  112  12.8234  15.7000  21.0424
...                          ...    ...  ...  ...      ...      ...      ...
2016 12         Premium Gasoline    6.6    0  111  12.5264  15.1000  20.9824
     12         Premium Gasoline    6.6    0  117  12.5264  15.1000  20.9824
     12         Premium Gasoline    6.3    0    0  10.8701  13.1973  16.5788
     12         Premium Gasoline    6.3    0    0  11.1489  13.5520  16.6631
     12         Premium Gasoline    6.6  100    0  12.2026  14.9000  18.8752

                UHighway     comb  co2  feScore  ghgScore
year cylinders
2015 12          26.7000  14.6643  604        3         3
     12          28.3000  15.2827  580        3         3
     12          26.7000  14.6643  604        3         3
     12          28.6000  16.6020  534        4         4
     12          29.2000  15.5580  572        3         3
...                  ...      ...  ...      ...       ...
2016 12          26.4000  15.3013  580        2         2
     12          26.4000  15.3013  580        2         2
     12          22.6600  12.8633  692        1         1
     12          22.7818  13.0996  679        1         1
     12          26.0000  14.5110  609        2         2

[678 rows x 18 columns]

In [17]:
df.loc[:, "make":"trans"]

# Ÿáÿßÿ™ ŸÉŸÑ ÿßŸÑÿµŸÅŸàŸÅ :
# ŸÖŸÜ ÿßŸÑÿπŸÖÿØ ÿØÿß ŸÑŸÑÿπŸÖŸàÿØ ÿØŸá  "make":"trans"

                         make                                model  \
year cylinders
2013 4             Volkswagen                                   CC
     4              Chevrolet                       Malibu eAssist
     4                Hyundai                        Genesis Coupe
     4                Hyundai                        Genesis Coupe
     4             Volkswagen                                   CC
...                       ...                                  ...
2018 12               Bentley           Continental GT Convertible
     12               Bentley  Continental Supersports Convertible
     12               Bentley                          Flying Spur
     12         Mercedes-Benz                         Maybach S650
     12         Mercedes-Benz                              AMG S65

                         VClass              drive              trans
year cylinders
2013 4             Compact Cars  Front-Wheel Drive  Automatic (AM-S6)
     4             Midsize Cars  Front-Wheel Drive     Automatic (S6)
     4          Subcompact Cars   Rear-Wheel Drive    Automatic 8-spd
     4          Subcompact Cars   Rear-Wheel Drive       Manual 6-spd
     4             Compact Cars  Front-Wheel Drive       Manual 6-spd
...                         ...                ...                ...
2018 12         Subcompact Cars    All-Wheel Drive     Automatic (S8)
     12         Subcompact Cars    All-Wheel Drive     Automatic (S8)
     12            Midsize Cars    All-Wheel Drive     Automatic (S8)
     12              Large Cars   Rear-Wheel Drive    Automatic 7-spd
     12              Large Cars   Rear-Wheel Drive    Automatic 7-spd

[3929 rows x 5 columns]

In [18]:
df.loc[(2018, 12) : , "make":"trans"]

                         make                                model  \
year cylinders
2018 12               Ferrari                            GTC4Lusso
     12                   BMW                         M760i xDrive
     12           Rolls-Royce                                 Dawn
     12           Rolls-Royce                               Wraith
     12           Rolls-Royce                              Phantom
     12           Rolls-Royce                          Phantom EWB
     12           Rolls-Royce                                Ghost
     12           Rolls-Royce                            Ghost EWB
     12          Aston Martin                             Rapide S
     12          Aston Martin                    Vanquish S Zagato
     12               Bentley           Continental GT Convertible
     12               Bentley  Continental Supersports Convertible
     12               Bentley                          Flying Spur
     12         Mercedes-Benz                         Maybach S650
     12         Mercedes-Benz                              AMG S65

                          VClass                    drive            trans
year cylinders
2018 12         Minicompact Cars  Part-time 4-Wheel Drive  Automatic (AM7)
     12               Large Cars          All-Wheel Drive   Automatic (S8)
     12             Compact Cars         Rear-Wheel Drive   Automatic (S8)
     12             Midsize Cars         Rear-Wheel Drive   Automatic (S8)
     12               Large Cars         Rear-Wheel Drive   Automatic (S8)
     12               Large Cars         Rear-Wheel Drive   Automatic (S8)
     12               Large Cars         Rear-Wheel Drive   Automatic (S8)
     12               Large Cars         Rear-Wheel Drive   Automatic (S8)
     12          Subcompact Cars         Rear-Wheel Drive   Automatic (S8)
     12         Minicompact Cars         Rear-Wheel Drive   Automatic (S8)
     12          Subcompact Cars          All-Wheel Drive   Automatic (S8)
     12          Subcompact Cars          All-Wheel Drive   Automatic (S8)
     12             Midsize Cars          All-Wheel Drive   Automatic (S8)
     12               Large Cars         Rear-Wheel Drive  Automatic 7-spd
     12               Large Cars         Rear-Wheel Drive  Automatic 7-spd

In [19]:
df.iloc[1:4, 0:2]

                   id       make
year cylinders
2013 4          32208  Chevrolet
     4          32214    Hyundai
     4          32215    Hyundai

## **Working with Pivot Tables**

In [125]:
import pandas as pd
df = pd.read_csv(r"fuel-econ.csv")

car_pivot = df.pivot_table(values="cylinders", index="make", columns="year", aggfunc="mean", fill_value=0)
car_pivot

FileNotFoundError: [Errno 2] No such file or directory: 'fuel-econ.csv'

In [26]:
car_pivot.loc["Toyota": ]

year            2013      2014      2015      2016      2017      2018
make
Toyota      4.428571  4.333333  4.235294  4.235294  4.173913  4.222222
Volkswagen  4.416667  4.263158  4.111111  4.142857  4.200000  4.125000
Volvo       5.375000  5.600000  5.000000  4.700000  4.000000  4.000000

In [27]:
car_pivot.mean( axis="index")
# ÿßÿ≠ÿ≥ÿ® ÿßŸÑŸÖÿ™Ÿàÿ≥ÿ∑ ŸÑŸÉŸÑ ÿπŸÖŸàÿØ ŸäÿπŸÜŸä ŸáŸäŸÖÿ¥Ÿä ÿµŸÅ ÿ®ÿµŸÅ

year
2013    5.491641
2014    5.331673
2015    5.129161
2016    5.081343
2017    5.363156
2018    4.967688
dtype: float64

In [28]:
car_pivot.mean( axis="columns")
# ÿßÿ≠ÿ≥ÿ® ÿßŸÑŸÖÿ™Ÿàÿ≥ÿ∑ ŸÑŸÉŸÑ ÿµŸÅ ŸäÿπŸÜŸä ŸáŸäŸÖÿ¥Ÿä ÿπŸÖŸàÿØ ÿ®ÿπŸÖŸàÿØ

make
Acura                 5.191077
Alfa Romeo            1.555556
Aston Martin         12.000000
Audi                  5.515662
BMW                   5.972275
Bentley              10.130159
Buick                 4.548352
Cadillac              5.482803
Chevrolet             4.882073
Chrysler              5.962290
Dodge                 6.393238
Ferrari               9.722222
Fiat                  3.333333
Ford                  4.769612
Genesis               2.276190
Honda                 4.330469
Hyundai               4.456823
Infiniti              5.994668
Jaguar                6.411075
Karma                 0.666667
Kia                   4.294912
Lexus                 6.210185
Lincoln               5.300000
Lotus                 3.000000
MINI                  3.789383
Maserati              7.041667
Mazda                 4.023810
Mercedes-Benz         6.785602
Mitsubishi            3.671429
Nissan                4.482083
Porsche               6.212190
Rolls-Royce          12.000000
Roush Performance     6.666667
Scion                 2.666667
Subaru                4.204092
Suzuki                0.666667
Toyota                4.271438
Volkswagen            4.209799
Volvo                 4.779167
dtype: float64

# **work with pandas 1 ( concat )**

In [163]:
import pandas as pd
data = pd.DataFrame({
    'ID' : [1, 2, 3, 4],
    'Name' : ['Sara' , 'Ahmed' , 'Ali' , 'Hassan'],
    'Age' : [19 , 18 , 20 , 21],
    'Gender': ['F' , 'M' ,'M' , 'M']})

In [164]:
data['Course'] = ['AI' , 'Web' , 'UI' , 'NLP']

In [165]:
data_2 = pd.DataFrame({
    'ID' : [1, 2, 3],
    'Name' : ['Ibrahim' , 'Mohamed' , 'youssef'],
    'Age' : [20 , 23 , 24 ],
    'Gender': ['M' , 'M' ,'M' ],
    'Course':['AI' , 'CS' , 'Web']})

In [166]:
new_data = pd.concat([data , data_2], ignore_index=True)
new_data

   ID     Name  Age Gender Course
0   1     Sara   19      F     AI
1   2    Ahmed   18      M    Web
2   3      Ali   20      M     UI
3   4   Hassan   21      M    NLP
4   1  Ibrahim   20      M     AI
5   2  Mohamed   23      M     CS
6   3  youssef   24      M    Web

In [167]:
# count values
new_data['Course'].value_counts()

Course
AI     2
Web    2
UI     1
NLP    1
CS     1
Name: count, dtype: int64

In [168]:
# unqiue
new_data['Course'].unique()

array(['AI', 'Web', 'UI', 'NLP', 'CS'], dtype=object)

In [169]:
# num of unique values
new_data['Course'].nunique()

5

In [170]:
# info about data
new_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      7 non-null      int64
 1   Name    7 non-null      object
 2   Age     7 non-null      int64
 3   Gender  7 non-null      object
 4   Course  7 non-null      object
dtypes: int64(2), object(3)
memory usage: 412.0+ bytes

In [171]:
new_data.describe() # numercal featuers

             ID        Age
count  7.000000   7.000000
mean   2.285714  20.714286
std    1.112697   2.138090
min    1.000000  18.000000
25%    1.500000  19.500000
50%    2.000000  20.000000
75%    3.000000  22.000000
max    4.000000  24.000000

In [172]:
print(len(new_data))
print(new_data.shape)

7
(7, 5)

In [173]:
new_data[new_data['Age'] >= 21]

   ID     Name  Age Gender Course
3   4   Hassan   21      M    NLP
5   2  Mohamed   23      M     CS
6   3  youssef   24      M    Web

In [174]:
course_ai = new_data[new_data['Course'] == 'AI']
course_ai

   ID     Name  Age Gender Course
0   1     Sara   19      F     AI
4   1  Ibrahim   20      M     AI

In [175]:
new_data[(new_data['Age'] >= 20) & (new_data['Course'] == 'AI')]

   ID     Name  Age Gender Course
4   1  Ibrahim   20      M     AI

In [176]:
new_data.sort_values(['Age'], ignore_index=True, inplace=True)
new_data

   ID     Name  Age Gender Course
0   2    Ahmed   18      M    Web
1   1     Sara   19      F     AI
2   3      Ali   20      M     UI
3   1  Ibrahim   20      M     AI
4   4   Hassan   21      M    NLP
5   2  Mohamed   23      M     CS
6   3  youssef   24      M    Web

In [178]:
new_data.sort_values(['Age' , 'Name'] , ascending=True , inplace=True , ignore_index= True )
new_data

   ID     Name  Age Gender Course
0   2    Ahmed   18      M    Web
1   1     Sara   19      F     AI
2   3      Ali   20      M     UI
3   1  Ibrahim   20      M     AI
4   4   Hassan   21      M    NLP
5   2  Mohamed   23      M     CS
6   3  youssef   24      M    Web

In [179]:
new_data.drop("ID", axis=1)

      Name  Age Gender Course
0    Ahmed   18      M    Web
1     Sara   19      F     AI
2      Ali   20      M     UI
3  Ibrahim   20      M     AI
4   Hassan   21      M    NLP
5  Mohamed   23      M     CS
6  youssef   24      M    Web

In [181]:
new_data.drop(columns=["ID"], inplace=True)
new_data

      Name  Age Gender Course
0    Ahmed   18      M    Web
1     Sara   19      F     AI
2      Ali   20      M     UI
3  Ibrahim   20      M     AI
4   Hassan   21      M    NLP
5  Mohamed   23      M     CS
6  youssef   24      M    Web

In [184]:
# replace
new_data['Gender'] = new_data['Gender'].replace({'M': "Male", "F": "Female"})
new_data

      Name  Age  Gender Course
0    Ahmed   18    Male    Web
1     Sara   19  Female     AI
2      Ali   20    Male     UI
3  Ibrahim   20    Male     AI
4   Hassan   21    Male    NLP
5  Mohamed   23    Male     CS
6  youssef   24    Male    Web

In [185]:
# rename
new_data.rename({'Name': 'Student Name'} , axis=1, inplace= True)
new_data

  Student Name  Age  Gender Course
0        Ahmed   18    Male    Web
1         Sara   19  Female     AI
2          Ali   20    Male     UI
3      Ibrahim   20    Male     AI
4       Hassan   21    Male    NLP
5      Mohamed   23    Male     CS
6      youssef   24    Male    Web

In [186]:
new_data.to_csv('new_data.csv')

In [188]:
df = pd.read_csv("new_data.csv")
df

   Unnamed: 0 Student Name  Age  Gender Course
0           0        Ahmed   18    Male    Web
1           1         Sara   19  Female     AI
2           2          Ali   20    Male     UI
3           3      Ibrahim   20    Male     AI
4           4       Hassan   21    Male    NLP
5           5      Mohamed   23    Male     CS
6           6      youssef   24    Male    Web

In [189]:
df.drop(columns=['Unnamed: 0'], inplace=True)
df

  Student Name  Age  Gender Course
0        Ahmed   18    Male    Web
1         Sara   19  Female     AI
2          Ali   20    Male     UI
3      Ibrahim   20    Male     AI
4       Hassan   21    Male    NLP
5      Mohamed   23    Male     CS
6      youssef   24    Male    Web

# **work with pandas 2 ( Time )**

In [191]:
import pandas as pd
df = pd.read_csv("covid-daywise.csv")
df.head()

         date  new_cases  new_deaths  new_tests
0  2019-12-31        0.0         0.0        NaN
1  2020-01-01        0.0         0.0        NaN
2  2020-01-02        0.0         0.0        NaN
3  2020-01-03        0.0         0.0        NaN
4  2020-01-04        0.0         0.0        NaN

In [192]:
df.tail()

           date  new_cases  new_deaths  new_tests
243  2020-08-30     1444.0         1.0    53541.0
244  2020-08-31     1365.0         4.0    42583.0
245  2020-09-01      996.0         6.0    54395.0
246  2020-09-02      975.0         8.0        NaN
247  2020-09-03     1326.0         6.0        NaN

In [193]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 248 entries, 0 to 247
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        248 non-null    object
 1   new_cases   248 non-null    float64
 2   new_deaths  248 non-null    float64
 3   new_tests   135 non-null    float64
dtypes: float64(3), object(1)
memory usage: 7.9+ KB

In [194]:
df.describe()

         new_cases  new_deaths     new_tests
count   248.000000  248.000000    135.000000
mean   1094.818548  143.133065  31699.674074
std    1554.508002  227.105538  11622.209757
min    -148.000000  -31.000000   7841.000000
25%     123.000000    3.000000  25259.000000
50%     342.000000   17.000000  29545.000000
75%    1371.750000  175.250000  37711.000000
max    6557.000000  971.000000  95273.000000

In [195]:
df.isna().sum()

date            0
new_cases       0
new_deaths      0
new_tests     113
dtype: int64

In [196]:
df['date']

0      2019-12-31
1      2020-01-01
2      2020-01-02
3      2020-01-03
4      2020-01-04
          ...
243    2020-08-30
244    2020-08-31
245    2020-09-01
246    2020-09-02
247    2020-09-03
Name: date, Length: 248, dtype: object

In [199]:
df.iloc[:21:2, ::2]
# == data.loc[0 : 20 : 2  , 'date':'new_tests':2 ]

          date  new_deaths
0   2019-12-31         0.0
2   2020-01-02         0.0
4   2020-01-04         0.0
6   2020-01-06         0.0
8   2020-01-08         0.0
10  2020-01-10         0.0
12  2020-01-12         0.0
14  2020-01-14         0.0
16  2020-01-16         0.0
18  2020-01-18         0.0
20  2020-01-20         0.0

In [223]:
df['id'] = range(1, len(df) + 1)
df

           date  new_cases  new_deaths  new_tests   id
0    2019-12-31        0.0         0.0        NaN    1
1    2020-01-01        0.0         0.0        NaN    2
2    2020-01-02        0.0         0.0        NaN    3
3    2020-01-03        0.0         0.0        NaN    4
4    2020-01-04        0.0         0.0        NaN    5
..          ...        ...         ...        ...  ...
243  2020-08-30     1444.0         1.0    53541.0  244
244  2020-08-31     1365.0         4.0    42583.0  245
245  2020-09-01      996.0         6.0    54395.0  246
246  2020-09-02      975.0         8.0        NaN  247
247  2020-09-03     1326.0         6.0        NaN  248

[248 rows x 5 columns]

In [224]:
df.set_index('id', inplace=True)
df

           date  new_cases  new_deaths  new_tests
id
1    2019-12-31        0.0         0.0        NaN
2    2020-01-01        0.0         0.0        NaN
3    2020-01-02        0.0         0.0        NaN
4    2020-01-03        0.0         0.0        NaN
5    2020-01-04        0.0         0.0        NaN
..          ...        ...         ...        ...
244  2020-08-30     1444.0         1.0    53541.0
245  2020-08-31     1365.0         4.0    42583.0
246  2020-09-01      996.0         6.0    54395.0
247  2020-09-02      975.0         8.0        NaN
248  2020-09-03     1326.0         6.0        NaN

[248 rows x 4 columns]

In [226]:
df.reset_index(inplace=True)
df

     index   id        date  new_cases  new_deaths  new_tests
0        0    1  2019-12-31        0.0         0.0        NaN
1        1    2  2020-01-01        0.0         0.0        NaN
2        2    3  2020-01-02        0.0         0.0        NaN
3        3    4  2020-01-03        0.0         0.0        NaN
4        4    5  2020-01-04        0.0         0.0        NaN
..     ...  ...         ...        ...         ...        ...
243    243  244  2020-08-30     1444.0         1.0    53541.0
244    244  245  2020-08-31     1365.0         4.0    42583.0
245    245  246  2020-09-01      996.0         6.0    54395.0
246    246  247  2020-09-02      975.0         8.0        NaN
247    247  248  2020-09-03     1326.0         6.0        NaN

[248 rows x 6 columns]

In [227]:
df.drop(columns=['index', 'id'], inplace=True)

In [228]:
df

           date  new_cases  new_deaths  new_tests
0    2019-12-31        0.0         0.0        NaN
1    2020-01-01        0.0         0.0        NaN
2    2020-01-02        0.0         0.0        NaN
3    2020-01-03        0.0         0.0        NaN
4    2020-01-04        0.0         0.0        NaN
..          ...        ...         ...        ...
243  2020-08-30     1444.0         1.0    53541.0
244  2020-08-31     1365.0         4.0    42583.0
245  2020-09-01      996.0         6.0    54395.0
246  2020-09-02      975.0         8.0        NaN
247  2020-09-03     1326.0         6.0        NaN

[248 rows x 4 columns]

In [237]:
df['date'] = pd.to_datetime(df['date'])

In [238]:
df['year'] = pd.DatetimeIndex(df['date']).year

In [240]:
df['month'] = pd.DatetimeIndex(df['date']).month

In [241]:
df['day'] = pd.DatetimeIndex(df['date']).day

In [242]:
df.head()

        date  new_cases  new_deaths  new_tests  year  month  day
0 2019-12-31        0.0         0.0        NaN  2019     12   31
1 2020-01-01        0.0         0.0        NaN  2020      1    1
2 2020-01-02        0.0         0.0        NaN  2020      1    2
3 2020-01-03        0.0         0.0        NaN  2020      1    3
4 2020-01-04        0.0         0.0        NaN  2020      1    4

In [243]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 248 entries, 0 to 247
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        248 non-null    datetime64[ns]
 1   new_cases   248 non-null    float64
 2   new_deaths  248 non-null    float64
 3   new_tests   135 non-null    float64
 4   year        248 non-null    int32
 5   month       248 non-null    int32
 6   day         248 non-null    int32
dtypes: datetime64[ns](1), float64(3), int32(3)
memory usage: 10.8 KB

In [256]:
# check duplicates
df.duplicated().sum()

np.int64(0)

In [257]:
# remove duplicates
df.drop_duplicates(inplace=True)

In [249]:
# Group by
df.groupby(df['month'])['new_cases'].sum()

month
1          3.0
2        885.0
3     100851.0
4     101852.0
5      29073.0
6       7772.0
7       6722.0
8      21060.0
9       3297.0
12         0.0
Name: new_cases, dtype: float64

In [250]:
df.dropna(how='all', inplace=True)

In [254]:
df.dropna(how='any' , inplace=True, ignore_index=True)

In [255]:
df

          date  new_cases  new_deaths  new_tests  year  month  day
0   2020-04-20     3047.0       433.0     7841.0  2020      4   20
1   2020-04-21     2256.0       454.0    28095.0  2020      4   21
2   2020-04-22     2729.0       534.0    44248.0  2020      4   22
3   2020-04-23     3370.0       437.0    37083.0  2020      4   23
4   2020-04-24     2646.0       464.0    95273.0  2020      4   24
..         ...        ...         ...        ...   ...    ...  ...
130 2020-08-28     1409.0         5.0    65135.0  2020      8   28
131 2020-08-29     1460.0         9.0    64294.0  2020      8   29
132 2020-08-30     1444.0         1.0    53541.0  2020      8   30
133 2020-08-31     1365.0         4.0    42583.0  2020      8   31
134 2020-09-01      996.0         6.0    54395.0  2020      9    1

[135 rows x 7 columns]

In [258]:
df1 = pd.read_csv("covid-daywise.csv")

In [259]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 248 entries, 0 to 247
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        248 non-null    object
 1   new_cases   248 non-null    float64
 2   new_deaths  248 non-null    float64
 3   new_tests   135 non-null    float64
dtypes: float64(3), object(1)
memory usage: 7.9+ KB

In [262]:
df1.isnull().sum()

date            0
new_cases       0
new_deaths      0
new_tests     113
dtype: int64

In [261]:
df1['new_tests'].first_valid_index()

111

In [263]:
df1['new_tests'] = df1['new_tests'].fillna(df1['new_tests'].mean() )

In [264]:
df1.isnull().sum()

date          0
new_cases     0
new_deaths    0
new_tests     0
dtype: int64

# **work with pandas 3**

In [265]:
import pandas as pd

In [266]:
data = pd.read_csv("locations.csv")

In [267]:
data.head()

,location,continent,population,life_expectancy,hospital_beds_per_thousand,gdp_per_capita
0,Afghanistan,Asia,38928341.0,64.83,0.50,1803.987
1,Albania,Europe,2877800.0,78.57,2.89,11803.431
2,Algeria,Africa,43851043.0,76.88,1.90,13913.839
3,Andorra,Europe,77265.0,83.73,NaN,NaN
4,Angola,Africa,32866268.0,61.15,NaN,5819.495

In [268]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 212 entries, 0 to 211
Data columns (total 6 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   location                    212 non-null    object
 1   continent                   210 non-null    object
 2   population                  211 non-null    float64
 3   life_expectancy             208 non-null    float64
 4   hospital_beds_per_thousand  165 non-null    float64
 5   gdp_per_capita              184 non-null    float64
dtypes: float64(4), object(2)
memory usage: 10.1+ KB

In [271]:
data['continent'].mode()[0]

'Africa'

In [273]:
data['continent'] = data['continent'].fillna(data['continent'].mode()[0])

In [277]:
data.columns

Index(['location', 'continent', 'population', 'life_expectancy',
       'hospital_beds_per_thousand', 'gdp_per_capita'],
      dtype='object')

In [289]:
for x in data.columns:
    if data[x].dtype == 'float64':
        data[x] = data[x].fillna(data[x].mean())

In [290]:
data.isnull().sum()

location                      0
continent                     0
population                    0
life_expectancy               0
hospital_beds_per_thousand    0
gdp_per_capita                0
dtype: int64

# **Merge**

In [2]:
import pandas as pd

In [3]:
df_1 = pd.DataFrame({
    'ID' : [1 , 2 , 3],
    'Name' : ["Sara" , 'Ali' , 'Mohamed'],
    'Age' : [20 , 21 , 19]
})

df_2= pd.DataFrame({
    'ID' : [1 , 2 , 3, 4],
    'Course' : ['AI' , 'Web' , 'UI', 'ML'],
    'Income': [20000 , 16000 , 14000 , 18000]})

In [4]:
pd.merge(df_1 , df_2 , on = 'ID' , how='inner' )   # ÿßŸÑŸÖÿ¥ÿ™ÿ±ŸÉ

   ID     Name   Age Course  Income
0   1     Sara  20.0     AI   20000
1   2      Ali  21.0    Web   16000
2   3  Mohamed  19.0     UI   14000
3   4      NaN   NaN     ML   18000